Repository: onesmalldog/TUIKit_iOS
Catalog: live/Resources/Localized/TUILiveKitLocalized.xcstrings
Source language: en
Languages: ar, ja, zh_hans, zh_hant

# common_client_error_operation_not_supported_in_current_room_type
source: This Operation is Not Supported in the Current Room Type
ar: هذه العملية غير مدعومة في نوع الغرفة الحالي
ja: この操作は現在の部屋の種類ではサポートされていません
zh_hans: 当前房间类型下不支持该操作
zh_hant: 當前房間類型下不支持該操作

# common_client_error_permission_denied
source: Failed to Obtain Permission, Unauthorized Audio/Video Permission, Please Check if Device Permission is Enabled
ar: فشل الحصول على الإذن، تحقق من تفعيل أذونات الجهاز
ja: アクセス許可の取得に失敗し、オーディオ/ビデオ許可は現在許可されていません。デバイスのアクセス許可が有効かどうかを確認してください。
zh_hans: 获取权限失败，当前未授权音/视频权限，请查看是否开启设备权限
zh_hant: 獲取權限失敗，當前未授權音/視頻權限，請查看是否開啟設備權限

# common_client_error_repeat_operation
source: Repeat Operation
ar: عملية مكررة
ja: 操作を繰り返します
zh_hans: 重复操作
zh_hant: 重複操作

# common_client_error_request_id_invalid
source: Signaling Request ID is Invalid or Has Been Processed
ar: معرف طلب الإشارة غير صالح أو تمت معالجته
ja: 信号要求IDが無効であるか、処理されています
zh_hans: 信令请求 ID 无效或已经被处理过
zh_hant: 信令請求 ID 無效或已經被處理過

# common_client_error_request_id_repeat
source: Signal request repetition
ar: تكرار طلب الإشارة
ja: シグナリングリクエストを繰り返します
zh_hans: 信令请求重复
zh_hant: 信令請求重複

# common_client_error_request_no_permission
source: No Permission for Signaling Request, e.g. Canceling an Invite Not Initiated by Yourself
ar: لا يوجد إذن لطلب الإشارة
ja: シグナリングリクエストには、自分で開始されない招待状のキャンセルなど、権限がありません
zh_hans: 信令请求无权限，例如取消非自己发起的邀请
zh_hant: 信令請求無權限，例如取消非自己發起的邀請

# common_client_error_require_payment
source: This feature requires an additional package. Please activate the corresponding package as needed in the TRTC Console
ar: تتطلب هذه الميزة باقة إضافية
ja: この関数では、追加のパッケージを有効にする必要があります。 Tencent CloudビデオキューブSDKコンソールで必要に応じて、対応するパッケージを有効にしてください
zh_hans: 该功能需要开通额外的套餐，请在 腾讯云视立方 SDK 控制台 按需开通对应套餐
zh_hant: 該功能需要開通額外的套餐，請在 騰訊雲視立方 SDK 控制臺 按需開通對應套餐

# common_client_error_room_id_invalid
source: Illegal Custom Room ID, Must Be Printable ASCII Characters (0x20-0x7e), Up to 48 Bytes Long
ar: معرف الغرفة المخصص غير قانوني
ja: 部屋IDの作成は違法であり、カスタムIDは印刷可能なASCII文字（0x20-0x7E）で、最大48バイトである必要があります
zh_hans: 创建房间 ID 非法，自定义 ID 必须为可打印 ASCII 字符（0x20-0x7e），最长48个字节
zh_hant: 創建房間 ID 非法，自定義 ID 必須為可列印 ASCII 字符（0x20-0x7e），最長48個字節

# common_client_error_room_name_invalid
source: Illegal Room Name, Maximum 30 Bytes, Must Be UTF-8 Encoding if Contains Chinese Characters
ar: اسم الغرفة غير قانوني
ja: 部屋の名前は違法で、名前の長さは最大30バイトです。中国語が含まれている場合は、キャラクターエンコードがUTF-8でなければなりません
zh_hans: 房间名称非法，名称最长30字节，字符编码必须是 UTF-8 ，如果包含中文
zh_hant: 房間名稱非法，名稱最長30位元組，字符編碼必須是 UTF-8 ，如果包含中文

# common_client_error_room_not_support_preloading
source: The current room does not support preloading
ar: الغرفة الحالية لا تدعم التحميل المسبق
ja: プリロードは現在の部屋ではサポートされていません
zh_hans: 当前房间不支持预加载
zh_hant: 當前房間不支持預加載

# common_client_error_sdk_app_id_not_found
source: Not Found SDKAppID, Please Confirm Application Info in TRTC Console
ar: لم يتم العثور على SDKAppID
ja: sdkappidは見つかりませんでした、Tencent CloudビデオキューブSDKコンソールのアプリケーション情報を確認してください
zh_hans: 未找到 SDKAppID，请在 腾讯云视立方 SDK 控制台 确认应用信息
zh_hant: 未找到 SDKAppID，請在 騰訊雲視立方 SDK 控制臺 確認應用信息

# common_client_error_sdk_not_initialized
source: Not Logged In, Please Call Login API
ar: لم يتم تسجيل الدخول، يرجى استدعاء API تسجيل الدخول
ja: ログインしていないので、ログインインターフェイスに電話してください
zh_hans: 未登录,请调用 Login 接口
zh_hant: 未登錄,請調用 Login 接口

# common_client_error_seat_index_not_exist
source: Seat Serial Number Does Not Exist
ar: رقم المقعد التسلسلي غير موجود
ja: 位置番号は存在しません
zh_hans: 麦位编号不存在
zh_hant: 麥位編號不存在

# common_client_error_send_message_disabled_for_all
source: All Members Muted in the Current Room
ar: تم كتم صوت جميع الأعضاء في الغرفة الحالية
ja: 部屋は禁止されています
zh_hans: 当前房间已开启全员禁言
zh_hant: 當前房間已開啟全員禁言

# common_client_error_send_message_disabled_for_current
source: You Have Been Muted in the Current Room
ar: تم كتم صوتك في الغرفة الحالية
ja: あなたは現在の部屋で禁止されています
zh_hans: 当前房间内，您已被禁言
zh_hant: 當前房間內，您已被禁言

# common_client_error_start_screen_sharing_failed
source: Failed to Enable Screen Sharing, Check if Someone is Already Screen Sharing in the Room
ar: فشل تفعيل مشاركة الشاشة
ja: 画面共有を有効にすることができませんでした、部屋の誰かが画面を共有しているかどうかを確認しました
zh_hans: 开启屏幕分享失败，检查房间内是否有人正在屏幕分享
zh_hant: 開啟屏幕分享失敗，檢查房間內是否有人正在屏幕分享

# common_client_error_success
source: Operation Successful
ar: تمت العملية بنجاح
ja: 操作は成功しました
zh_hans: 操作成功
zh_hant: 操作成功

# common_client_error_user_need_admin_permission
source: Room Owner or Administrator Permission Required for Operation
ar: مطلوب إذن صاحب الغرفة أو المسؤول
ja: 運営するには、住宅所有者または管理者からの許可が必要です
zh_hans: 需要房主或者管理员权限才能操作
zh_hant: 需要房主或者管理員權限才能操作

# common_client_error_user_need_owner_permission
source: Room Owner Permission Required for Operation
ar: مطلوب إذن صاحب الغرفة
ja: 運営するには、住宅所有者からの許可が必要です
zh_hans: 需要房主权限才能操作
zh_hant: 需要房主權限才能操作

# common_client_error_user_not_exist
source: User is not exist
ar: المستخدم غير موجود
ja: ユーザーは存在しません
zh_hans: 用户不存在
zh_hant: 用戶不存在

# common_server_error_gift_ability_not_enabled
source: Gift service is not enabled yet please check your package version
ar: خدمة الهدايا غير مفعلة بعد
ja: ギフト機能サービスはまだ有効になっていません。パッケージバージョンを確認してください
zh_hans: 礼物功能服务暂未开启，请检查套餐包版本
zh_hant: 禮物功能服務暫未開啟，請檢查套餐包版本

# common_server_error_gift_not_exist
source: Gift does not exist
ar: الهدية غير موجودة
ja: 贈り物は存在しません
zh_hans: 礼物不存在
zh_hant: 禮物不存在

# common_server_error_gift_server_pre_verification_failed
source: Gift server pre-verification failed please check console configuration
ar: فشل التحقق المسبق من خادم الهدايا
ja: ギフトサーバーの事前確認が失敗しました。コンソールの構成を確認してください
zh_hans: 礼物服务器预验证失败，请检查控制台配置
zh_hant: 禮物伺服器預驗證失敗，請檢查控制台配置

# common_server_error_call_in_progress
source: The device operation failed while in a call
ar: فشلت عملية الجهاز أثناء المكالمة
ja: 呼び出しでは、デバイスの操作に失敗しました
zh_hans: 正在通话中，设备操作失败
zh_hant: 正在通話中，設備操作失敗

# common_ear_return_volume
source: Ear Monitor Volume
ar: مستوى صوت سماعة الأذن
ja: 耳のリベート量
zh_hans: 耳返音量
zh_hant: 耳返音量

# live_clarity
source: Clarity
ar: الوضوح
ja: 明確さ
zh_hans: 清晰度
zh_hant: 清晰度

# common_seat_management
source: Seat
ar: المقعد
ja: マイクロコントローラー
zh_hans: 麦控
zh_hant: 麥控

# common_anchor_audience_list_panel_title
source: Online audience
ar: الجمهور المتصل
ja: オンラインオーディエンス
zh_hans: 在线观众
zh_hant: 在線觀眾

# common_audio_effect
source: Audio
ar: الصوت
ja: 効果音
zh_hans: 音效
zh_hant: 音效

# common_audio_effect_settings
source: Audio Effect Settings
ar: إعدادات المؤثرات الصوتية
ja: サウンドエフェクト設定
zh_hans: 音效设置
zh_hant: 音效設置

# common_audio_settings
source: Audio settings
ar: إعدادات الصوت
ja: オーディオ設定
zh_hans: 音频设置
zh_hant: 音頻設置

# common_beauty_item_close
source: Close
ar: إغلاق
ja: 閉鎖
zh_hans: 关闭
zh_hant: 關閉

# common_beauty_item_ruddy
source: Rosy
ar: وردي
ja: バラ色
zh_hans: 红润
zh_hant: 紅潤

# common_beauty_item_smooth
source: Microdermabrasion
ar: تنعيم البشرة
ja: 皮膚研削
zh_hans: 磨皮
zh_hant: 磨皮

# common_beauty_item_whiteness
source: Whitening
ar: تبييض
ja: ホワイトニング
zh_hans: 美白
zh_hant: 美白

# common_beauty_panel_title
source: One-click beauty
ar: تجميل بنقرة واحدة
ja: ワンクリックの美しさ
zh_hans: 一键美颜
zh_hant: 一鍵美顏

# common_cancel
source: Cancel
ar: إلغاء
ja: キャンセル
zh_hans: 取消
zh_hant: 取消

# common_change_voice
source: Voice changer
ar: مغير الصوت
ja: 音声の変化
zh_hans: 变声
zh_hant: 變聲

# common_change_voice_child
source: Naughty child
ar: طفل مشاغب
ja: クマの子供
zh_hans: 熊孩子
zh_hant: 熊孩子

# common_change_voice_ethereal
source: Ethereal
ar: أثيري
ja: 空の精神
zh_hans: 空灵
zh_hant: 空靈

# common_change_voice_girl
source: Loli
ar: لولي
ja: ロリ
zh_hans: 萝莉
zh_hant: 蘿莉

# common_change_voice_none
source: Original
ar: أصلي
ja: オリジナルのサウンドトラック
zh_hans: 原声
zh_hant: 原聲

# common_change_voice_uncle
source: Uncle
ar: عم
ja: 叔父
zh_hans: 大叔
zh_hant: 大叔

# common_common_gift_income
source: Gift Income
ar: دخل الهدايا
ja: ギフト収入
zh_hans: 礼物收入
zh_hant: 禮物收入

# common_common_like_count
source: Likes Count
ar: عدد الإعجابات
ja: いいね
zh_hans: 点赞数量
zh_hant: 點讚數量

# common_common_live_duration
source: Duration
ar: المدة
ja: ライブブロードキャスト期間
zh_hans: 直播时长
zh_hant: 直播時長

# common_common_live_people_number
source: Total Views
ar: إجمالي المشاهدات
ja: 累積視聴
zh_hans: 累计观看
zh_hant: 累計觀看

# common_common_message_count
source: Messages
ar: الرسائل
ja: メッセージの数
zh_hans: 消息数量
zh_hant: 消息數量

# common_common_send_gift_people_count
source: Gift givers
ar: مقدمو الهدايا
ja: ギフトの数
zh_hans: 送礼人数
zh_hant: 送禮人數

# common_common_this_live_data
source: Live data
ar: بيانات البث
ja: ライブブロードキャストデータ
zh_hans: 本场直播数据
zh_hant: 本場直播數據

# common_ear_return
source: Ear Monitor
ar: سماعة الأذن
ja: 耳の復帰
zh_hans: 耳返
zh_hant: 耳返

# common_set_cover
source: Set Cover
ar: تعيين الغلاف
ja: カバーを変更します
zh_hans: 修改封面
zh_hant: 修改封面

# common_end_link
source: End Co-guest
ar: إنهاء البث المشترك
ja: 接続を切断します
zh_hans: 断开连麦
zh_hant: 斷開連麥

# common_end_live
source: End Live
ar: إنهاء البث
ja: ライブブロードキャストを終了します
zh_hans: 结束直播
zh_hant: 結束直播

# common_exit_connect
source: Exit connect
ar: الخروج من الاتصال
ja: 連線終結
zh_hans: 退出连线
zh_hant: 退出連線

# common_end_user
source: End
ar: إنهاء
ja: 電話を切る
zh_hans: 挂断
zh_hant: 掛斷

# common_entered_room
source: Entered room
ar: دخل الغرفة
ja: 部屋に入ります
zh_hans: 进入房间
zh_hant: 進入房間

# common_follow_anchor
source: Follow
ar: متابعة
ja: 焦点を当てる
zh_hans: 关注
zh_hant: 關注

# common_gift_give_gift
source: Send Out
ar: إرسال
ja: 贈り物
zh_hans: 赠送
zh_hant: 贈送

# common_gift_title
source: Gift
ar: هدية
ja: 贈り物
zh_hans: 礼物
zh_hant: 禮物

# common_hang_up
source: Hang Up
ar: إنهاء المكالمة
ja: 電話を切る
zh_hans: 挂断
zh_hant: 掛斷

# common_kick_user_confirm_message
source: Are you sure you want to remove xxx?
ar: هل أنت متأكد أنك تريد إزالة xxx؟
ja: ％sを削除したいですか？
zh_hans: 确定要移除xxx吗？
zh_hant: 確定要移除xxx嗎?

# common_link_mic_manager
source: Link Management
ar: إدارة الربط
ja: マイク管理への接続
zh_hans: 连麦管理
zh_hant: 連麥管理

# common_live_has_stop
source: Live broadcast has ended
ar: انتهى البث المباشر
ja: ライブブロードキャストは終了しました
zh_hans: 直播已结束
zh_hant: 直播已結束

# common_more_settings
source: More settings
ar: المزيد من الإعدادات
ja: その他の設定
zh_hans: 更多设置
zh_hant: 更多設置

# common_music
source: Music
ar: الموسيقى
ja: 音楽
zh_hans: 音乐
zh_hant: 音樂

# common_music_cheerful
source: Cheerful
ar: مرح
ja: ハッピー
zh_hans: 欢快
zh_hant: 歡快

# common_music_confirm
source: Confirm
ar: تأكيد
ja: 確認する
zh_hans: 确认
zh_hant: 確認

# common_music_melancholy
source: Melancholy
ar: حزين
ja: 憂鬱
zh_hans: 忧郁
zh_hant: 憂鬱

# common_music_tips_title
source: Warm Tips
ar: نصائح مفيدة
ja: 親切なヒント
zh_hans: 温馨提示
zh_hant: 溫馨提示

# common_music_volume
source: Music volume
ar: مستوى صوت الموسيقى
ja: 音楽のボリューム
zh_hans: 音乐音量
zh_hant: 音樂音量

# common_music_wonder_world
source: Magical World
ar: عالم سحري
ja: 魔法の世界
zh_hans: 神奇世界
zh_hant: 神奇世界

# common_people_volume
source: Voice volume
ar: مستوى صوت الصوت
ja: 人間の音量
zh_hans: 人声音量
zh_hant: 人聲音量

# common_accept
source: Accept
ar: قبول
ja: 同意する
zh_hans: 同意
zh_hant: 同意

# common_receive
source: Accept
ar: قبول
ja: 受け入れる
zh_hans: 接受
zh_hant: 接受

# common_reject
source: Reject
ar: رفض
ja: 拒否する
zh_hans: 拒绝
zh_hant: 拒絕

# common_reverb
source: Reverb
ar: صدى
ja: 残響
zh_hans: 混响
zh_hant: 混響

# common_reverb_loud_and_loud
source: Loud
ar: عالي
ja: ホン・リアン
zh_hans: 洪亮
zh_hant: 洪亮

# common_reverb_low
source: Low
ar: منخفض
ja: 低い
zh_hans: 低沉
zh_hant: 低沉

# common_reverb_metallic_sound
source: Metallic sound
ar: صوت معدني
ja: メタルサウンド
zh_hans: 金属声
zh_hant: 金屬聲

# common_reverb_none
source: No effect
ar: بدون تأثير
ja: 効果はありません
zh_hans: 无效果
zh_hant: 無效果

# common_room_destroy
source: Broadcast has been ended
ar: انتهى البث
ja: ライブブロードキャストは終了しました
zh_hans: 直播已结束
zh_hant: 直播已結束

# common_room_info_liveroom_id
source: Live Room ID:
ar: معرف غرفة البث:
ja: ライブルームID：
zh_hans: 直播房间ID：
zh_hant: 直播房間ID：

# common_sent
source: Sent
ar: تم الإرسال
ja: に与える
zh_hans: 送给
zh_hant: 送給

# common_main_item_video_live
source: Video Live
ar: البث المباشر بالفيديو
ja: オンラインでライブブロードキャスト
zh_hans: 在线直播
zh_hant: 在線直播

# common_go_live
source: Go Live
ar: ابدأ البث
ja: ライブブロードキャストを開始します
zh_hans: 开直播
zh_hant: 開直播

# common_main_item_voice_room
source: Voice Room
ar: غرفة الصوت
ja: 言語チャットルーム
zh_hans: 语聊房
zh_hant: 語聊房

# common_server_error_already_on_the_mic
source: Already on the seat
ar: موجود بالفعل على المقعد
ja: すでに小麦の上に
zh_hans: 已经处于麦上状态
zh_hant: 已經處於麥上狀態

# common_server_error_already_on_the_mic_queue
source: Already on the seat queue
ar: موجود بالفعل في قائمة انتظار المقاعد
ja: すでにフェリー状態にあります
zh_hans: 已经处于排麦状态
zh_hant: 已經處於排麥狀態

# common_server_error_battle_does_not_exist_or_has_ended
source: The battle does not exist or has ended
ar: المنافسة غير موجودة أو انتهت
ja: 戦いは存在しないか、終わっていません
zh_hans: 该场次 battle 不存在或已结束
zh_hant: 該場次 battle 不存在或已結束

# common_server_error_battle_session_has_ended
source: The battle session has ended
ar: انتهت جلسة المنافسة
ja: 戦いは終わりました
zh_hans: 该 battle 场次已经结束
zh_hant: 該 battle 場次已經結束

# common_server_error_connection_does_not_exist
source: The current connection does not exist or has ended
ar: الاتصال الحالي غير موجود أو انتهى
ja: 現在の接続は存在しません
zh_hans: 当前连线不存在或结束
zh_hant: 當前連線不存在或結束

# common_server_error_creating_battles_too_frequently
source: creating battles too frequently. Wait a moment and try again
ar: إنشاء المنافسات بشكل متكرر جداً. انتظر لحظة وحاول مرة أخرى
ja: 頻繁に戦闘を短時間で開始し、試してみる前に少し待ってください
zh_hans: 短时间内频繁发起 battle, 稍等一会再试
zh_hant: 短時間內頻繁發起 battle, 稍等一會再試

# common_server_error_creating_connections_too_frequent
source: creating connections too frequent in a short time. Wait a moment and try again
ar: إنشاء الاتصالات بشكل متكرر جداً. انتظر لحظة وحاول مرة أخرى
ja: 短期間で頻繁に接続しすぎて、試してみる前にしばらく待ちます
zh_hans: 短时间内连线过于频繁，稍等一会再试
zh_hant: 短時間內連線過於頻繁，稍等一會再試

# common_server_error_creating_rooms_exceeds_the_frequency_limit
source: Creating rooms exceeds the frequency limit, the same room ID can only be created once within 1 second
ar: تجاوز إنشاء الغرف حد التردد
ja: 頻度は制限を超えます。たとえば、部屋の作成は制限を超え、同じ部屋IDは1秒に1回しか作成できません
zh_hans: 频率超过限制，例如创建房间超过频率超限，同一房间 ID， 1秒内只能创建一次
zh_hant: 頻率超過限制，例如創建房間超過頻率超限，同一房間 ID， 1秒內只能創建一次

# common_server_error_exceeds_the_upper_limit
source: Exceeds the upper limit, for example, the number of microphone seats, the number of PK match rooms, etc., exceeds the payment limit
ar: تجاوز الحد الأعلى
ja: 支払い制限は、クロークの最大数、PKセッションの数などを超えて支払い制限を超えます。
zh_hans: 超过付费上限，例如麦位数，pk场次房间数量等超过付费限制
zh_hant: 超過付費上限，例如麥位數，pk場次房間數量等超過付費限制

# common_server_error_has_exceeded_the_limit_in_connection_or_battle
source: The room number has exceeded the limit in connection or battle
ar: تجاوز رقم الغرفة الحد في الاتصال أو المنافسة
ja: 接続部屋とバトルルームの最大数を超えました
zh_hans: 超过连线和 battle 房间数量上限
zh_hant: 超過連線和 battle 房間數量上限

# common_server_error_in_other_battle
source: The room is already in other battle
ar: الغرفة موجودة بالفعل في منافسة أخرى
ja: この部屋は他の戦闘セッションにあります
zh_hans: 该房间处于其他的 battle 场次中
zh_hant: 該房間處於其他的 battle 場次中

# common_server_error_insufficient_operation_permissions
source: You are currently unable to perform this operation (possibly due to lack of permission or scenario restrictions)
ar: لا يمكنك حالياً تنفيذ هذه العملية
ja: 現在この操作を実行できません（権限がない、またはシナリオの制限などの理由による可能性があります）
zh_hans: 您当前无法执行此操作（可能是无权限，或受场景限制等原因）
zh_hant: 您當前無法執行此操作（可能是無權限，或受場景限制等原因）

# common_server_error_invalid_room_type
source: Invalid room type
ar: نوع غرفة غير صالح
ja: 無効な部屋の種類
zh_hans: 无效的房间类型
zh_hant: 無效的房間類型

# common_server_error_is_connecting_with_other_rooms
source: The current room is connecting with other rooms
ar: الغرفة الحالية متصلة بغرف أخرى
ja: 現在の部屋は他の部屋に接続されています
zh_hans: 当前房间与其他房间连线中
zh_hant: 當前房間與其他房間連線中

# common_server_error_is_not_allowed_to_cancel_battle_for_room_in_battle
source: It's not allowed to cancel battle for room in battle
ar: لا يُسمح بإلغاء المنافسة للغرفة في المنافسة
ja: 部屋は戦いにあります
zh_hans: 该房间处于 battle 中
zh_hant: 該房間處於 battle 中

# common_server_error_metadata_no_valid_keys
source: There is no valid keys when delete metadata
ar: لا توجد مفاتيح صالحة عند حذف البيانات الوصفية
ja: ルームメタデータを削除するとき、削除されたキーはどれも存在しません
zh_hans: 删除房间 meta 数据时候，被删除的 key 没有一个存在
zh_hant: 刪除房間 meta 數據時候，被刪除的 key 沒有一個存在

# common_server_error_metadata_number_of_keys_exceeds_the_limit
source: The number of keys in the room's Metadata exceeds the limit
ar: عدد المفاتيح في البيانات الوصفية للغرفة يتجاوز الحد
ja: ルームメタデータのキーの数は上限を超えています
zh_hans: 房间 meta 数据中的 key 数量超过上限
zh_hant: 房間 meta 數據中的 key 數量超過上限

# common_server_error_metadata_size_of_value_exceeds_the_limit
source: The size of value in the room's Metadata exceeds the maximum byte limit
ar: حجم القيمة في البيانات الوصفية للغرفة يتجاوز الحد الأقصى للبايت
ja: ルームメタデータの単一キーに対応するVALは、バイト制限の最大数を超えています
zh_hans: 房间 meta 数据中单个 key 对应的 val 超过最大字节数限制
zh_hant: 房間 meta 數據中單個 key 對應的 val 超過最大字節數限制

# common_server_error_metadata_the_size_of_key_exceeds_the_maximum_byte_limit
source: The size of key in the room's Metadata exceeds the maximum byte limit
ar: حجم المفتاح في البيانات الوصفية للغرفة يتجاوز الحد الأقصى للبايت
ja: ルームメタデータのキーサイズは、バイト制限の最大数を超えています
zh_hans: 房间 meta 数据中的 key 大小超过了最大字节数限制
zh_hant: 房間 meta 數據中的 key 大小超過了最大字節數限制

# common_server_error_metadata_total_size_exceeds_the_limit
source: The total size of all value in the room's Metadata exceeds the maximum byte limit
ar: الحجم الإجمالي لجميع القيم في البيانات الوصفية للغرفة يتجاوز الحد الأقصى للبايت
ja: ルームメタデータのすべてのキーに対応するバルの合計は、バイト制限の最大数を超えています
zh_hans: 房间 meta数据中所有 key 对应的 val 总和超过最大字节数限制
zh_hant: 房間 meta數據中所有 key 對應的 val 總和超過最大字節數限制

# common_server_error_mic_seat_is_locked
source: The seat is locked. You can try another seat
ar: المقعد مقفل. يمكنك تجربة مقعد آخر
ja: マットレスの位置がロックされています、マットレスの位置を変更してみることができます
zh_hans: 麦位已锁定，可以尝试换一个麦位
zh_hant: 麥位已鎖定，可以嘗試換一個麥位

# common_server_error_no_payment_information
source: No payment information, you need to purchase a package in the console
ar: لا توجد معلومات دفع، تحتاج لشراء باقة
ja: 有料情報はありません、コンソールでパッケージを購入する必要があります
zh_hans: 无付费信息，需在控制台购买套餐包
zh_hant: 無付費信息，需在控制臺購買套餐包

# common_server_error_no_rooms_in_the_battle_is_valid
source: None of the rooms in the battle is valid
ar: لا توجد غرفة صالحة في المنافسة
ja: 開始された戦いには有効な部屋はありません
zh_hans: 发起的 battle 里没有一个有效的房间
zh_hant: 發起的 battle 裡沒有一個有效的房間

# common_server_error_not_a_room_member
source: Not a room member
ar: ليس عضواً في الغرفة
ja: 部屋以外のメンバー
zh_hans: 非房间成员
zh_hant: 非房間成員

# common_server_error_not_on_the_mic_queue
source: Not on the seat queue
ar: ليس في قائمة انتظار المقاعد
ja: 配置リストにはありません
zh_hans: 没有在排麦列表中
zh_hant: 沒有在排麥列表中

# common_server_error_not_on_the_mic_seat
source: Not on the seat
ar: ليس على المقعد
ja: 小麦の上ではありません
zh_hans: 未在麦上
zh_hant: 未在麥上

# common_server_error_not_started_yet
source: The battle has not started yet
ar: لم تبدأ المنافسة بعد
ja: 戦いはまだ始まっていません
zh_hans: 该 battle 场次还未开始
zh_hant: 該 battle 場次還未開始

# common_server_error_param_illegal
source: The parameter is illegal. Check whether the request is correct according to the error description
ar: المعلمة غير قانونية
ja: 違法なパラメーターをご覧ください。エラーの説明に従ってリクエストが正しいかどうかを確認してください。
zh_hans: 请参数非法，请根据错误描述检查请求是否正确
zh_hant: 請參數非法，請根據錯誤描述檢查請求是否正確

# common_server_error_requires_password
source: The current room requires a password for entry
ar: الغرفة الحالية تتطلب كلمة مرور للدخول
ja: 現在の部屋では、入力するにはパスワードが必要です
zh_hans: 当前房间需要密码才能进入
zh_hant: 當前房間需要密碼才能進入

# common_server_error_room_admin_quantity_exceeds_the_upper_limit
source: The admin quantity exceeds the upper limit
ar: عدد المسؤولين يتجاوز الحد الأعلى
ja: 管理者の数は制限を超えています
zh_hans: 管理员数量超过上限
zh_hant: 管理員數量超過上限

# common_server_error_room_does_not_exist
source: The room does not exist, or it once existed but has now been dissolved
ar: الغرفة غير موجودة أو تم حلها
ja: 部屋は存在せず、存在していませんが、解散しました
zh_hans: 房间不存在，或者曾经存在过，但是目前已经被解散
zh_hant: 房間不存在，或者曾經存在過，但是目前已經被解散

# common_server_error_room_does_not_support_mic_ability
source: The room does not support seat ability
ar: الغرفة لا تدعم ميزة المقاعد
ja: この部屋はMSをサポートしていません
zh_hans: 该房间不支持连麦
zh_hant: 該房間不支持連麥

# common_server_error_room_entry_password_error
source: Room Entry Password Error
ar: خطأ في كلمة مرور دخول الغرفة
ja: 部屋に入るためのパスワードが誤っていません
zh_hans: 进房密码错误
zh_hant: 進房密碼錯誤

# common_server_error_room_id_exists
source: The room ID already exists. Please select another room ID
ar: معرف الغرفة موجود بالفعل. يرجى اختيار معرف آخر
ja: 部屋IDが使用されました、別の部屋IDを選択してください
zh_hans: 房间ID 已被使用，请选择别的房间ID
zh_hant: 房間ID 已被使用，請選擇別的房間ID

# common_server_error_room_id_has_been_occupied_by_chat
source: The room ID has been occupied by Chat. You can use a different room ID or dissolve the group first
ar: معرف الغرفة مشغول بواسطة الدردشة
ja: 部屋IDはIMによって占有されています。別の部屋IDで使用するか、最初にIMインターフェイスを介してグループを解散させることができます。
zh_hans: 房间 ID 已被 IM 占用，可以换一个房间 ID 使用，或者先通过 IM 接口解散该群
zh_hant: 房間 ID 已被 IM 佔用，可以換一個房間 ID 使用，或者先通過 IM 接口解散該群

# common_server_error_room_id_has_been_used
source: The room ID has been used, and the operator is the room owner, it can be used directly
ar: تم استخدام معرف الغرفة، والمشغل هو صاحب الغرفة
ja: 部屋IDが使用されており、オペレーターは住宅所有者であり、直接使用できます
zh_hans: 房间 ID 已被使用，并且操作者为房主，可以直接使用
zh_hant: 房間 ID 已被使用，並且操作者為房主，可以直接使用

# common_server_error_room_is_full
source: The room is full
ar: الغرفة ممتلئة
ja: 部屋のメンバーはいっぱいです
zh_hans: 房间成员已满
zh_hant: 房間成員已滿

# common_server_error_room_is_in_connection
source: The room is already in connection
ar: الغرفة متصلة بالفعل
ja: 部屋はすでに接続されています
zh_hans: 该房间已经在连线中
zh_hant: 該房間已經在連線中

# common_server_error_seat_is_already_occupied
source: The current seat is already occupied
ar: المقعد الحالي مشغول بالفعل
ja: 現時点ではすでに人がいます
zh_hans: 当前麦位已经有人了
zh_hant: 當前麥位已經有人了

# common_server_error_signal_request_conflict
source: Signal request conflict
ar: تعارض طلب الإشارة
ja: シグナリングリクエストの競合
zh_hans: 信令请求冲突
zh_hant: 信令請求衝突

# common_server_error_system_internal_error
source: Server internal error, please retry
ar: خطأ داخلي في الخادم، يرجى إعادة المحاولة
ja: 内部サーバーエラー、もう一度やり直してください
zh_hans: 服务器内部错误，请重试
zh_hant: 伺服器內部錯誤，請重試

# common_server_error_tag_quantity_exceeds_upper_limit
source: Tag quantity Exceeds Upper limit
ar: عدد العلامات يتجاوز الحد الأعلى
ja: タグの数は上限を超えています
zh_hans: 标签数量超上限
zh_hant: 標籤數量超上限

# common_server_error_the_room_is_not_in_the_battle
source: The room isn‘t in the battle
ar: الغرفة ليست في المنافسة
ja: 部屋はもはや戦いにありません
zh_hans: 该房间已经不在 battle 中
zh_hant: 該房間已經不在 battle 中

# common_server_error_the_seat_list_is_empty
source: The seat list is empty
ar: قائمة المقاعد فارغة
ja: 接続されたマイクのリストは空です
zh_hans: 连麦列表为空
zh_hant: 連麥列表為空

# common_server_error_the_seats_are_all_taken
source: The seats are all taken.
ar: جميع المقاعد مشغولة.
ja: 座席はいっぱいです
zh_hans: 麦位已满
zh_hant: 麥位已滿

# common_server_error_there_is_a_pending_battle_request
source: There is a pending battle request for this room
ar: يوجد طلب منافسة معلق لهذه الغرفة
ja: この部屋には、保留中の戦闘リクエストがあります
zh_hans: 该房间存在待处理的 battle 请求
zh_hant: 該房間存在待處理的 battle 請求

# common_server_error_there_is_a_pending_connection_request
source: There is a pending connection request for this room
ar: يوجد طلب اتصال معلق لهذه الغرفة
ja: この部屋には保留中の接続リクエストがあります
zh_hans: 该房间存在待处理的连线请求
zh_hant: 該房間存在待處理的連線請求

# common_server_error_this_member_has_been_banned
source: This member has been banned
ar: تم حظر هذا العضو
ja: このメンバーは禁止されています
zh_hans: 该成员已经被封禁
zh_hant: 該成員已經被封禁

# common_server_error_this_member_has_been_muted
source: This member has been muted
ar: تم كتم صوت هذا العضو
ja: このメンバーは禁止されています
zh_hans: 该成员已经被禁言
zh_hant: 該成員已經被禁言

# common_server_error_user_is_already_on_the_mic_seat
source: The user is already on the seat
ar: المستخدم موجود بالفعل على المقعد
ja: マイクにはすでにユーザーがいます
zh_hans: 已经有用户在麦位上
zh_hant: 已經有用戶在麥位上

# common_set_as_background
source: Set as background
ar: تعيين كخلفية
ja: 背景として設定します
zh_hans: 设为背景
zh_hant: 設為背景

# common_set_as_cover
source: Set as cover
ar: تعيين كغلاف
ja: カバーとして設定します
zh_hans: 设为封面
zh_hant: 設為封面

# common_settings
source: Settings
ar: الإعدادات
ja: 設定
zh_hans: 设置
zh_hant: 設置

# common_settings_bg_image
source: Background
ar: الخلفية
ja: 背景
zh_hans: 背景
zh_hant: 背景

# common_stream_categories_beauty
source: Beauty
ar: جمال
ja: 外観
zh_hans: 颜值
zh_hant: 顏值

# common_stream_categories_default
source: Daily chat
ar: دردشة يومية
ja: 毎日のチャット
zh_hans: 日常聊天
zh_hant: 日常聊天

# common_stream_categories_shopping
source: Shopping
ar: تسوق
ja: 買い物
zh_hans: 购物
zh_hant: 購物
